Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: ཟླ་བའི་ཏོག་ཅེས་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་ས་ཆེན་པོ་གཡོས་ཤིང་མེ་ཏོག་གི་ཆར་ཆེན་པོ་དག་རབ་ཏུ་བབ་པར་གྱུར་པའི་རྒྱུ་ནི་གང་ལགས། རྐྱེན་ནི་གང་ལགས།
en: Those two bodhisattvas bowed down with palms together toward the Tathāgata Ratnacandra and asked, ‘Bhadanta Bhagavat, why did the great earth shake, a light shine, and a great rain of flowers fall?’ “

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡང་དག་རྟོག་ཅེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: The Tathāgata Ratnacandra answered, ‘There is, noble sons, in the western direction from this buddha realm, beyond as many buddha realms as there are grains of sand in the Ganges River, a world realm called Saṃtīraṇa.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་དེ་ན་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་ཞིག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་ཡང་དག་པར་སྟོན་པའི་སྨོན་ལམ་བཀོད་པའི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་དང་། གཟུངས་ཀྱི་སྒོ་བཀོད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འཆད་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་མང་པོ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་ཏོ།
en: In the buddha realm Saṃtīraṇa there resides, lives, and remains the tathāgata, and so on, up to and including the bhagavat buddha, Ratnagarbha, and he prophesies the highest, most complete enlightenment to many tens of millions of bodhisattvas while he gives them the Dharma discourse on the array of prayers that demonstrate the range of bodhisattva activity, the range of samādhis, and the array of dhāraṇī entrances.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་གཅིག་ཅིག་ཡོད་པ་དེས་སྨོན་ལམ་འདི་ལྟ་བུ་བཏབ་ཅིང་སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་བསྒོམས་པའི་ཚིག་བརྗོད་དེ།
en: Present there is a certain bodhisattva mahāsattva, Mahākāruṇika. He has uttered a prayer that is suffused with great compassion. “ ‘

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པ་བཤད་པ་དང་། སྲོག་ཆགས་བྱེ་བ་ཕྲག་མང་པོ་དག་གིས་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་ཀྱང་ཡོངས་སུ་བཟུང་བ་དང་།
en: The bodhisattvas there who have been given prophecies of their highest, most complete enlightenment prayed to bring many tens of millions of beings to enlightenment, have chosen the qualities of their buddha realms, and have prayed for the kinds of beings who will be the disciples they train. “ ‘

source: འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་འདུལ་བའི་བར་གྱི་སྨོན་ལམ་དེ་ལྟ་བུ་དག་ཀྱང་བརྗོད་པས་ན་གང་གིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ཟིལ་གྱིས་མནན་ཅིང་རྩོད་པའི་དུས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་སྙིགས་མ་ལྔ་དང་ལྡན་ཞིང་ཉོན་མོངས་པའི་སྒྲིབ་པ་ཅན་དང་།
en: Among them all, that one great bodhisattva who is endowed with great compassion has outshone the entire assembly, for he will take as his disciples those in a buddha realm that has the five degeneracies during the kaliyuga of obscuring kleśas.

source: མཚམས་མེད་པ་བྱེད་ཅིང་མི་དགེ་བའི་རྩ་བའི་བར་དག་དང་འགྲོགས་ལ་སེམས་ཀྱི་རྒྱུད་ཚིག་པའི་འདུལ་བ་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་གཅིག་པུ་རྣམ་པ་ཐམས་ཅད་དུ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Those disciples will have minds that are burning and will have committed the bad actions with immediate results at death, and so on, up to and including having engaged in creating bad roots. “ ‘

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་དེ་སྤངས་ནས་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་ཕྱི་མ་དེ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བརྩོན་ཞིང་ཡན་ལག་ལྔས་ཕྱག་བྱས་ཏེ་ཐལ་མོ་སྦྱར་ཞིང་འདུག་ནས་དེའི་བསྔགས་པ་ཡང་རྗོད་པར་བྱེད་དོ།
en: The entire assembly, and the world with its devas, humans, asuras, and gandharvas, have turned from the Tathāgata Ratnagarbha and are engaged in making offerings afterward to Mahākāruṇika.

source: །སེམས་ཅན་ཆེན་པོ་དེ་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་འདུག་ཅིང་ལུང་བསྟན་པ་ཉན་ཏོ།
en: They have bowed down the five points of their bodies, placed their palms together, and praised him. That mahāsattva has knelt down before that bhagavat, the Tathāgata Ratnagarbha, to listen to his prophecy.

source: །གང་གི་ཚེ་སེམས་ཅན་ཆེན་པོ་དེས་བཅོམ་ལྡན་འདས་དེའི་སྤྱན་སྔར་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་པར་གྱུར་པ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེས་འདི་ལྟ་སྟེ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་གཡོས་ཤིང་མེ་ཏོག་གི་ཆར་དག་ཀྱང་མངོན་པར་རབ་ཏུ་བབ་པར་གྱུར་པ་དེ་ལྟ་བུའི་འཛུམ་པ་མཛད་དོ།
en: When that mahāsattva knelt on his right knee before that bhagavat, the bhagavat smiled, and in the worlds in the ten directions, which are as numerous as the particles in a buddha realm, the ground shook and a rain of flowers fell.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་རབ་ཏུ་སད་པར་བྱ་བ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་སྤྱོད་པ་ངེས་པ་བསྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སངས་རྒྱས་ཀྱི་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་གི་ཕྱོགས་ནས་བསྡུ་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པའི་སྤྱོད་པ་འཇིགས་པ་མེད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེས་དེ་ལྟ་བུའི་ཆོ་འཕྲུལ་དག་བསྟན་ཏོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་ཀྱིས་ཡོངས་སུ་ཞུས་པ།
en: He performed these miracles so as to awaken the bodhisattva mahāsattvas in all those buddha realms, to reveal the activity of the compassionate bodhisattva’s prayer, so that bodhisattva mahāsattvas would come from those buddha realms as numerous as the particles in a buddha realm, and so that the bodhisattva mahāsattvas would be given the Dharma discourse on the fearless conduct that reveals the entrance to samādhi.’ “

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་གིས་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་དུ་ཉོན་མོངས་པ་དང་། འཁྲུག་པ་བདོ་ཞིང་རྩོད་པའི་དུས་ལ་བབ་པའི་དུས་ཡོངས་སུ་བཟུང་སྟེ། མཚམས་མ་མཆིས་པ་བགྱིད་པ་དང་། མི་དགེ་བའི་རྩ་བའི་བར་དང་འགྲོགས་པར་གྱུར་ཅིང་། སེམས་ཀྱི་རྒྱུད་ཚིག་པའི་འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་བཟུང་བར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་ཡུན་རིང་པོ་ཇི་སྲིད་ཅིག་ནས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་།
en: Noble son, the two bodhisattvas asked the Tathāgata Ratnacandra, ‘Bhadanta Bhagavat, this bodhisattva mahāsattva who has great compassion, who has chosen a world with the five degeneracies in the time of the kaliyuga in which kleśas and conflicts are strong, and who has chosen as his disciples those whose minds are burning, who have committed the bad actions with immediate results at death, and so on, up to and including those who are engaged in bad roots, how long has it been since he developed the aspiration for enlightenment?

source: ཡུན་རིང་པོ་ཇི་སྲིད་ཅིག་ཏུ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ལགས།
en: How long has he been practicing the conduct of enlightenment?’ “ ‘

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་ནི་ད་གདོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་དང་པོ་བསྐྱེད་དོ།
en: Noble sons,’ said the Tathāgata Ratnacandra, ‘that bodhisattva mahāsattva Mahākāruṇika has now, for the first time, developed the aspiration for the highest, most complete enlightenment.

source: །རིགས་ཀྱི་བུ་དག་ཁྱེད་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་དེར་དེང་ལ། ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པའི་སྤྱོད་པ་འཇིགས་པ་མེད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ཡང་ཉོན་ཅིག །
en: Noble sons, you should go to the buddha realm Saṃtīraṇa in order to see, pay homage to, and honor the tathāgata arhat samyaksam­buddha Ratnagarbha, and listen to him give the Dharma discourse on the fearless conduct that reveals the entrance to samādhi.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་ལ་ངའི་ཚིག་གིས་དྲིས་ལ་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་སྐྱེས་བུ་དམ་པ་ཁྱོད་ལ་འདྲི་བ་མཛད་དེ།
en: You should address the bodhisattva mahāsattva Mahākāruṇika with these words of mine: “Worthy being, the Tathāgata Ratnacandra addresses you.

source: མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་ཡང་བསྐུར་ཞིང་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: He has sent you these flowers, which are as stainless as the moon’s radiance, and he congratulates you. “ ‘

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་དེ་ལྟར་སེམས་དང་པོ་བསྐྱེད་པ་ནས་སྙིང་རྗེ་ཆེན་པོ་བརྗོད་པས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་སྒྲས་གང་བར་གྱུར་ཏེ། དེས་ན་ཁྱོད་ཀྱིས་ཐམས་ཅད་དུ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཞེས་བྱ་བའི་མིང་རབ་ཏུ་ཐོབ་པ་ཡིན་ནོ།
en: Good man, you, who are called Mahākāruṇika, have developed the first aspiration for enlightenment that expresses great compassion in such a way that the sound of your name has filled the buddha realms among the world realms in the ten directions, which are as numerous as the number of particles in a buddha realm. Therefore, everywhere you have acquired the name Mahākāruṇika. “ ‘

source: །སྐྱེས་བུ་དམ་པ་དེའི་ཕྱིར་ཁྱོད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཕྱི་མ་རྣམས་ལ་ཡང་སྙིང་རྗེ་ཆེན་པོ་བརྗོད་པའི་སྨོན་ལམ་གྱིས་ཡང་དང་ཡང་དུ་བྱམས་པའི་རྒྱལ་མཚན་ལེགས་པར་འཛུགས་པར་འགྱུར་ཏེ།
en: Therefore, you, good man, through your compassionate words, will excellently raise again and again the victory banner of kindness toward future bodhisattva mahāsattvas. “ ‘

source: སྐྱེས་བུ་དམ་པ་དེའི་ཕྱིར་མ་འོངས་པའི་བསྐལ་པ་གྲངས་མེད་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཏུ་ཡང་། ཡང་དང་ཡང་དུ་ཁྱོད་ཀྱི་སྙན་པ་དང་གྲགས་པའི་སྒྲས་ཀུན་ཏུ་གང་བར་འགྱུར་རོ།
en: Therefore, good man, during countless future eons, as numerous as the particles in a buddha realm, word of your fame and renown will furthermore fill world realms in the ten directions as numerous as the particles in a buddha realm. “ ‘

source: །གང་ཁྱོད་ཀྱིས་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་གྲངས་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་ནས་བཅོམ་ལྡན་འདས་ལ་ཕུལ་བ་རྣམས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་པར་གྱུར་ཏེ།
en: You have made many hundreds of thousands of millions of trillions of beings aspire to the highest, most complete enlightenment and caused them to enter into and be established in that aspiration. You have brought them before the Bhagavat and established them in irreversibility from the highest enlightenment.

source: དེ་ལ་ཁ་ཅིག་སྨོན་ལམ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་གང་ཡིན་པ་དག་ནི་ཕྱིས་ལུང་བསྟན་པ་ཐོབ་པར་འགྱུར་རོ།
en: Some will, through prayer, choose an array of buddha-realm qualities, and afterward will receive the prophecy.

source: །གང་དག་ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཕྱིས་བསྐལ་པ་གྲངས་མེད་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བར་དག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་པོ་གཞན་དག་ཏུ་སངས་རྒྱས་ཉིད་ཐོབ་ཅིང་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས། དེ་དག་ཁྱོད་ལས་བརྩམས་ནས་བསྔགས་པ་བརྗོད་པར་འགྱུར་ཏེ།
en: Those whom you have directed toward enlightenment will attain buddhahood in world realms in the ten directions as numerous as the number of particles in a buddha realm, after as many innumerable eons have passed as there are particles in a buddha realm, and they will turn the wheel of the Dharma and speak their praise of you.

source: རྒྱུ་གསུམ་པོ་དེས་ན་སྐྱེས་བུ་དམ་པ་ཁྱོད་ལེགས་སོ་ཞེས་ཀྱང་སྨྲོས་ཤིག །ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དུང་ཕྱུར་ཕྲག་དགུ་དང་།
en: Therefore, it is for those three reasons, worthy being, that we should say, “Well done!” ’ “

source: བྱེ་བ་ཕྲག་གཉིས་ཀྱིས་ཚིག་འཐུན་པར་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། དེ་བཞིན་གཤེགས་པས་གང་ལ་ཡན་ལག་གསུམ་གྱིས་ལེགས་སོ་ཞེས་བགྱི་བ་སྤྲིང་ཞིང་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་བསྐུར་བའི་སྐྱེས་བུ་དམ་པ་དེ་ཡང་བལྟ་བའི་སླད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་དེར་མཆི་ལགས་སོ།
en: At that time 920,000,000 bodhisattvas said in one voice, ‘Bhadanta Bhagavat, we will also go to the buddha realm Saṃtīraṇa in order to pay homage to and honor the tathāgata arhat samyaksam­buddha Ratnagarbha, and to see that worthy being to whom the Tathāgata sends a message of threefold congratulations and gives these flowers, which are as stainless as the moon’s radiance.’ “

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་དེང་ལ། དེར་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པའི་སྤྱོད་པ་འཇིགས་པ་མེད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ཡང་ཉོན་ཅིག །
en: Noble son, the Tathāgata Ratnacandra said, ‘Noble sons, knowing that the time has come, you should go there and receive from the Tathāgata Ratnagarbha the Dharma discourse on the fearless conduct that reveals the entrance to samādhi.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་རིན་པོ་ཆེའི་ཏོག་དང་། ཟླ་བའི་ཏོག་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་ལས་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་བླངས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དུང་ཕྱུར་ཕྲག་དགུ་དང་། བྱེ་བ་ཕྲག་གཉིས་པོ་དག་དང་ལྷན་ཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་བསྩགས་པ་ནས་འཕགས་ནས། འདི་ལྟ་སྟེ་དཔེར་ན་གློག་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རིན་ཆེན་བསྩགས་པ་དེ་ནས་མི་སྣང་བར་གྱུར་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་གི་འཛམ་བུའི་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་འདིར་ལྷགས་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་།
en: Then, noble son, Ratnaketu and Candraketu received from the Tathāgata Ratnacandra the flowers that were as stainless as the moon’s radiance, and together with the 920,000,000 bodhisattvas they stood up in the world realm Ratnavicayā and like lightning disappeared from that assembly of bodhisattvas in the buddha realm Ratnavicayā and arrived at the Jambūvana Park in the buddha realm Saṃtīraṇa.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་མཆོད་པ་བྱས་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔ་ན་བྲམ་ཟེ་ལ་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་རྣམས་ཀྱིས་ཐལ་མོ་སྦྱར་ཅིང་བསྔགས་བརྗོད་པ་མཐོང་བ་དང་།
en: They went to where the Tathāgata Ratnagarbha was, approached him, bowed their heads down to the feet of the Tathāgata Ratnagarbha, and made offerings to him through their various miraculous bodhisattva powers. They saw the brahmin in the presence of the Tathāgata Ratnagarbha and saw the entire assembly of bodhisattvas with palms placed together, praising him.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་འདི་སྙམ་དུ་སེམས་ཏེ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བས་གང་ལ་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་དག་བསྐུར་བའི་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་ནི་འདི་ཡིན་པ་བལྟ་སྙམ་མོ།
en: The two bodhisattvas thought, ‘This must be the one with great compassion to whom the Tathāgata Ratnacandra has sent these flowers, which are as stainless as the moon’s radiance.’ “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་ཕྱིར་ཕྱོགས་ཏེ། བྲམ་ཟེ་ལ་མེ་ཏོག་ཕུལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྐྱེས་བུ་དམ་པ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བས་ཁྱོད་ལ་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་དག་ཀྱང་བསྐུར་ཏེ། སྐྱེས་བུ་དམ་པ་ཁྱོད་ལ་ལེགས་སོ་ཞེས་བྱ་བ་ཡང་སྤྲིང་ངོ་ཞེས་བྱ་བའི་བར་དུ་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་ནོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Then the two bodhisattvas turned from the Bhagavat, offered the flowers to the brahmin, and said, ‘Worthy being, the Tathāgata Ratnacandra has sent you these flowers, which are as stainless as the moon’s radiance, and he has sent you his congratulations, worthy being,’ and so on, as previously described. “

source: ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དག་ཐོགས་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་ཏུ་ལྷགས་པ་དང་།
en: In the same way, bodhisattva mahāsattvas from countless, innumerable buddha realms in the eastern direction came to the buddha realm Saṃtīraṇa carrying flowers that were as stainless as the moon’s radiance.

source: བྲམ་ཟེ་ལ་མེ་ཏོག་བསྐུར་བ་དང་། ཡན་ལག་གསུམ་གྱིས་ལེགས་སོ་ཞེས་བྱ་བ་སྤྲིང་བ་ཡང་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་ནོ།
en: They too brought the flowers to the brahmin and gave the message of threefold congratulation, as previously described. “

source: །དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་བདུན་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་བ་གམ་གྱིས་བསྒྱིངས་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: In the same way, in the southern direction from this buddha realm, beyond ninety-seven hundred million trillion buddha realms, there was the Niryūhavijṛṃbhita realm.

source: སངས་རྒྱས་ཀྱི་ཞིང་བ་གམ་གྱིས་བསྒྱིངས་པ་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སེང་གེ་ལྟར་བསྒྱིངས་པའི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འབའ་ཞིག་དག་ལ་ཐེག་པ་ཆེན་པོའི་གཏམ་འབའ་ཞིག་གི་ཆོས་སྟོན་ཏོ།
en: In the Niryūhavijṛṃbhita realm there resided, lived, and remained a tathāgata arhat samyaksam­buddha named Siṃhavijṛmbhiteśvararāja, and he taught the Dharma with a pure talk on the Mahāyāna to pure bodhisattva mahāsattvas.

source: །འཁོར་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཉིས་ལ་གཅིག་ནི་ཡེ་ཤེས་རྡོ་རྗེའི་ཏོག་ཅེས་བྱ། ཅིག་ཤོས་ནི་སེང་གེ་རྡོ་རྗེའི་ཏོག་ཅེས་བྱ་སྟེ།
en: In that assembly there were two bodhisattva mahāsattvas, one named Jñānavajraketu and the other named Siṃhavajraketu.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སེང་གེ་ལྟར་བསྒྱིངས་པའི་དབང་ཕྱུག་རྒྱལ་པོ་ལ་ཡོངས་སུ་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་ས་ཆེར་གཡོས་ཤིང་མེ་ཏོག་གི་ཆར་ཆེན་པོ་བབ་པར་གྱུར་པའི་རྒྱུ་ནི་གང་ལགས།
en: Those two bodhisattva mahāsattvas asked the Tathāgata Siṃhavijṛmbhiteśvararāja, ‘Bhadanta Bhagavat, what is the cause, what is the reason of the occurrence of a great earthquake and of the great rain of flowers?’

source: རྐྱེན་ནི་གང་ལགས་ཞེས་བྱ་བའི་བར་དུ་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་ནོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ་ལྷོ་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་གྲངས་མེད་པ་གཞན་དང་གཞན་དག་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་ཏུ་ལྷགས་པའི་བར་དུ་ཡང་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་ནོ།
en: and so on, as previously described, until the point where countless, innumerable hundreds of millions of trillions of bodhisattva mahāsattvas came from countless, innumerable buddha realms in the southern direction and arrived in the buddha realm Saṃtīraṇa, and so on, as previously described. “

source: །ཡང་དེའི་ཚེ་ན་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་གཅིག་འདས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སངས་རྒྱས་ཀྱི་ཞིང་རྒྱལ་བ་ཅན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: At that time, in the western direction from this buddha realm, beyond ninety-one hundred million trillion buddha realms, there was a buddha realm called Jayāvatī.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དབང་པོ་ཐུལ་བ་ཡངས་པའི་སྤྱན་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་འཁོར་བཞི་པོ་དག་ལ་ཐེག་པ་གསུམ་གྱིས་ཆོས་སྟོན་ཏོ།
en: A tathāgata named Jitendriyaviśālanetra resided, lived, and remained there, and he taught the Dharma of the three yānas to a fourfold assembly.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་སྣང་བྱེད་བཟང་པོ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཉིས་པ་སེང་གེ་ལྟར་བསྒྱིངས་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Present there was a bodhisattva mahāsattva named Bhadravairocana and a second bodhisattva mahāsattva named Siṃhavijṛmbhita.

source: སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དབང་པོ་ཐུལ་བ་ཡངས་པའི་སྤྱན་ལ་ས་ཆེར་གཡོས་ཤིང་མེ་ཏོག་གི་ཆར་ཆེན་པོ་བབ་པ་ཅི་ལས་གྱུར་ཅེས་དོན་དེ་ཡོངས་སུ་ཞུས་པའི་བར་དུ་ཡང་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་ནོ།
en: Those two worthy beings asked the Tathāgata Jitendriyaviśālanetra, ‘Bhadanta Bhagavat, why was there this great earthquake and this great rain of flowers?’ and so on, as previously described. “

source: །ཡང་དེའི་ཚེ་ན་བྱང་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུ་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་ངུར་སྨྲིག་ཅེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Also, at that time, in the northern direction from this buddha realm, beyond ninety trillion myriads of buddha realms, there was a world realm called Kāṣāya.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་ཞིག་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་དག་ལ་ཐེག་པ་ཆེན་པོའི་གཏམ་འབའ་ཞིག་གི་ཆོས་སྟོན་ཏོ།
en: A tathāgata, and so on, up to and including a bhagavat buddha, named Lokeśvararāja resided, lived, and remained there, and he taught the Dharma that was purely on the Mahāyāna to pure bodhisattvas who had entered the Mahāyāna.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཉིས་ལ་གཅིག་ནི་མི་གཡོ་བརྟན་པ་ཞེས་བྱ། ཅིག་ཤོས་ནི་ཤེས་རབ་འཛིན་ཅེས་བྱ་སྟེ།
en: Present there were two bodhisattva mahāsattvas, one named Acalasthāvara and the other named Prajñādhara.

source: དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་ལ་བཙུན་པ་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་ས་ཆེར་གཡོས་ཤིང་མེ་ཏོག་གི་ཆར་ཆེན་པོ་བབ་པར་གྱུར་པའི་རྒྱུ་ནི་གང་ལགས། རྐྱེན་ནི་གང་ལགས་ཞེས་ཡོངས་སུ་ཞུས་པའི་བར་དུ་ཡང་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་ནོ།
en: They both asked the Tathāgata Lokeśvararāja, ‘Bhadanta Bhagavat, what was the cause and what was the reason that there was a great earthquake and a great rain of flowers?’ and so on, as previously described. “

source: །ཡང་དེའི་ཚེ་ན་འོག་གི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་གཏི་མུག་མུན་བྲལ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Also, at that time, in the downward direction from this buddha realm, beyond ninety-eight hundred million trillion buddha realms, there was a world realm called Vigatatamondhakārā.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་ཀུན་ནས་ལྡང་བའི་འཇིགས་པ་དང་བྲལ་བའི་དབྱངས་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་འཁོར་བཞི་པོ་དག་ལ་ཐེག་པ་གསུམ་གྱིས་ཆོས་སྟོན་ཏོ།
en: A tathāgata named Vigatabhayaparyutthānaghoṣa resided, lived, and remained there, and he taught the Dharma of the three yānas to a fourfold assembly.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གཉིས་ལ་གཅིག་ནི་རྣམ་པར་སྣང་བྱེད་རྡུལ་བྲལ་ཞེས་བྱ། ཅིག་ཤོས་ནི་རྣམ་པར་སྣང་བྱེད་ཉི་མ་ཞེས་བྱ་བའི་བར་དུ་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་ནོ།
en: In that buddha realm there were two bodhisattva mahāsattvas, one named Arajavairocana and the other named Svargavairocana, and so on, as previously described. “

source: །ཡང་དེའི་ཚེ་ན་སྟེང་གི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཉི་འབུམ་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ། སངས་རྒྱས་ཀྱི་ཞིང་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་དེ་ན།
en: Also, at that time, in the upward direction from this buddha realm, beyond two hundred thousand buddha realms, there was a world realm called the Saṃkusumitā.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་རབ་རྒྱས་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་ཞིག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་འཁོར་བཞི་པོ་དག་ལ་ཐེག་པ་གསུམ་གྱིས་ཆོས་སྟོན་ཏོ།
en: A tathāgata, and so on, up to and including a bhagavat buddha, named Prasphulitakusuma­vairocana resided, lived, and remained there, and he taught the Dharma of the three yānas to a fourfold assembly.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཉིས་ཤིག་འཁོད་པ་ལ་གཅིག་ནི་རང་གིས་རྣམ་པར་འབྱེད་པས་ཡུལ་ཡང་དག་པར་འཁྲུག་པ་ཞེས་བྱ། ཅིག་ཤོས་ནི་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱིས་ཡང་དག་པར་རབ་ཏུ་དགའ་བ་རྣམ་པར་འཁྲུགས་པ་ཞེས་བྱ་སྟེ།
en: In that buddha realm there were two bodhisattva mahāsattvas, one named svaviṣayasṃkopitaviṣaya and the other named Dhāraṇī­saṃpraharṣaṇa­vikopita.

source: སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་རབ་རྒྱས་ལ་བཙུན་པ་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་ས་ཆེར་གཡོས་ཤིང་མེ་ཏོག་གི་ཆར་ཆེན་པོ་བབ་པར་གྱུར་པའི་རྒྱུ་གང་ལགས། རྐྱེན་ནི་གང་ལགས་ཞེས་ཞུས་པ་དང་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་རབ་རྒྱས་ཀྱིས་བཀའ་སྩལ་པ།
en: Those two worthy beings asked the Tathāgata Prasphulitakusuma­vairocana, ‘Bhadanta Bhagavat, what was the cause and what was the reason that there occurred a great earthquake in the world and a great rain of flowers?’ “
